test/load-test.yaml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 10
      arrivalRate: 250
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - flow:
      - post:
          url: "/orders"
          json:
            customer_id: 3
            product_id: 3
            quantity: 1